In [1]:
%matplotlib inline
import pandas as pd

In [ ]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [4]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [3]:
titles.head(10)

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008
5            Tight Spot  1955
6        Chocolate (II)  2011
7      Wang de Shengyan  2012
8       Bao dao mei ren  1956
9   A Man Called Nereus  2012

### How many movies are listed in the titles dataframe?

In [4]:
len(titles)

244914

### What are the earliest two films listed in the titles dataframe?

In [3]:
titles.sort_values('year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [5]:
len(titles[titles.title =='Hamlet'])

20

### How many movies are titled "North by Northwest"?

In [8]:
len(titles[titles.title =='North by Northwest'])

1

### When was the first movie titled "Hamlet" made?

In [10]:
titles[titles.title =='Hamlet'].sort_values('year').head(1)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [11]:
titles[titles.title =='Treasure Island'].sort_values('year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [12]:
len(titles[titles.year == 1950])

1113

### How many movies were made in the year 1960?

In [13]:
len(titles[titles.year == 1960])

1549

### How many movies were made from 1950 through 1959?

In [15]:
t = titles
len(t[(1950 <= t.year)&(t.year<=1959)])

12934

In [16]:
len(t[(t.year // 10 == 195)])

12934

### In what years has a movie titled "Batman" been released?

In [19]:
t = titles
t[t.title == 'Batman']

         title  year
39349   Batman  1943
240896  Batman  1989


### How many roles were there in the movie "Inception"?

In [104]:
cast = pd.read_csv('cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [73]:
c = cast

In [74]:
len(c[c.title == 'Inception'])

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [75]:
c = cast
c = c[c.title == 'Inception']
c = c[c.n.isnull()]
len(c)

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [9]:
c = cast
c = c[c.title == 'Inception']
c = c[c.n.notnull()]
len(c)

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [ ]:
c = cast
c = c[c.title == 'North by Northwest']
c = c[c.n.notnull()]
c = c.sort('n')
c

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [96]:
c = cast

In [ ]:
c = c[c.title == 'Sleuth']
c = c[c.year == 1972]
c = c.sort('n')
c

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

### How many roles were credited in the silent 1921 version of Hamlet?

In [83]:
c = cast

In [84]:
c = c[(c.title == 'Hamlet') & (c.year == 1921)]
len(c)

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [82]:
c= cast
c= c[(c.title == 'Hamlet') & (c.year == 1996)]
len(c)

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [81]:
c=cast
c = c[c.character == 'Hamlet']
len(c)

96

### How many people have played an "Ophelia"?

In [80]:
c = cast
c = c[c.character == 'Ophelia']
len(c)

117

### How many people have played a role called "The Dude"?

In [105]:
c = cast
c = c[c.character == 'The Dude']
len(c)

19

### How many people have played a role called "The Stranger"?

In [106]:
c = cast

In [108]:
c = c[c.character == 'The Stranger']
len(c)

212

### How many roles has Sidney Poitier played throughout his career?

In [109]:
c = cast
c = c[c.name == 'Sidney Poitier']
len(c)

43

### How many roles has Judi Dench played?

In [110]:
c = cast
c = c[c.name == 'Judi Dench']
len(c)

55

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [ ]:
c = cast
c = c[c.name == 'Cary Grant']
c = c[c.year // 10 == 194]
c = c[c.n == 2]
c = c.sort('year')
c

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [ ]:
c = cast
c = c[c.name == 'Cary Grant']
c = c[c.year // 10 == 194]
c = c[c.n == 1 ]
c = c.sort('year')
c

### How many roles were available for actors in the 1950s?

In [112]:
c = cast
c = c[c.year // 10 == 195]
c = c[c.type == 'actor']
len(c)

157738

### How many roles were available for actresses in the 1950s?

In [113]:
c = cast
c = c[c.year // 10 == 195]
c = c[c.type == 'actress']
len(c)

57733

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [114]:

c = cast
c = c[c.year <= 1980]
c = c[c.n == 1]
len(c)

65140

### How many non-leading roles were available through from the beginning of film history through 1980?

In [115]:
c = cast

In [116]:
c = c[c.year <= 1980]
c = c[c.n != 1]
len(c)

1117667

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [117]:
c = cast

In [118]:
c = c[c.year <= 1980]
c = c[c.n.isnull()]
len(c)

448347